{    "Presentations": {
        "Invited Talks": {
            "2015": {
                "What the Laws Demand of Socrates---and of Us": ["Stanford University, Political Theory Workshop"],
                "Democratic Rule of Law Reform, Circa 403 B.C.E.": ["Stanford University, Freeman Spogli Institute for International Studies and Stanford Law School"],
                "General Will, Causality, Equality": ["Georgetown University, McDonough School of Business"],
                "Thinking Aloud About Vulnerability and Policy": ["American Association of Law Schools Midyear Meeting, Workshop on Next Generation Issues on Sex, Gender and the Law (plenary session)"],
                "Democratic Paternalism, not Libertarian Paternalism": ["Georgetown University McDonough School of Business, Symposium on Nudging"]
            },
            "2014": {
                "Underprotection, Domination, and Group-Subordinating Violence": ["Cardozo Law School Conference on Republicanism and Criminal Law"],
                "Racial Classification and Ascriptive Injury": ["Loyola University Chicago School of Law faculty workshop"],
                "What the Laws Demand of Socrates---and of Us": ["Princeton University, Law and Public Affairs seminar", "Loyola University New Orleans School of Law faculty workshop"],
                "Critical Race Science Studies?": ["Fordham Law Review symposium on critical race theory and empirical methods"]
            },
            "2013": {
                "How Demanding is Occupational Liberty?": ["Annual Meeting of the American Philosophical Association., Pacific Division (invited commentary on Tomasi, Free Market Fairness)"]
            }
        },
        "Conference Talks": {
            "2015": {
                "Heaven Save Us From Legal Heroes": ["American Association of Law Schools Annual Meeting, Law and Humanities Section"],
                "What the Laws Demand of Socrates---and of Us": ["American Society for Legal History"]
            },
            "2014": {
                "Racial Classification and Ascriptive Injury": ["Midwest People of Color Legal Scholarship Conference", "John Mercer Langston Conference", "Mid-Atlantic Law and Society Association Annual Meeting"],
                "An Islamic Rule of Law": ["Mid-Atlantic People of Color Legal Scholarship Conference"],
                "A Commitment to Equality: The Rule of Law in the Real World (two book MS chapters)": ["Culp Colloquium at Duke Law School"],
                "A Respect-Centered Sex Discrimination Jurisprudence": ["Southeast Association of Law Schools Annual Meeting"]
            },
            "2013": {
                "Institutional Values, or How to Say What Democracy Is": ["Southwestern Philosophical Society"],
                "The Rule of Law Will Not Set You Free": ["Midwest Law and Economics Association"],
                "The People's Will and the People's Laws": ["Midwest People of Color Legal Scholarship Conference", "Annual Meeting of the Law and Society Association", "American Political Science Association", "Association for Political Theory", "Loyola Constitutional Law Colloquium"],
                "Equal Law in an Unequal World": ["Southeast/Southwest People of Color Legal Scholarship Conference", "Arizona State University Legal Scholars Workshop", "Mid-Atlantic People of Color Legal Scholarship Conference", "Sharing Scholarship, Building Teachers Development Workshop at Albany Law School"],
                "The Countermajoritarian Complaint": ["American Political Science Association"]
            },
            "2012": {
                "Equal Law in an Unequal World": ["Classcrits V, University of Wisconsin, Madison", "Washington University Regional Junior Faculty Workshop"],
                "The Countermajoritarian Complaint": ["Loyola Constitutional Law Colloquium"],
                "Death and Taxes in NFIB v. Sebelius": ["Medical Humanities Conference, Western Michigan University"],
                "Democracy, Solidarity, and the Rule of Law: Lessons from Athens": ["Big Ten Conference for Untenured Scholars, Indiana University Maurer School of Law"],
                "Violence and Inequality: The Liberal Critique of Domination": ["Western Political Science Association"]
            },
            "2010": {
                "When does the Rule of Law Persist? A Strategic Model of Institutional Endurance": ["Midwest Law and Economics Association"],
                "Para-Ideal Theory and the Strategic Justification of Democracy": ["Democracy as Idea and Practice Conference, University of Oslo", "Canadian Political Science Association"]
            },
            "2009": {
                "Don't be Afraid, the Clown's Afraid Too: Deliberation, Participation, Tolerance and Fear": ["Association for Political Theory"],
                "Strategic Morality and Para-Ideal Theory": ["Graduate Conference in Political Philosophy, University of Pavia"],
                "Making Space for Rosa Parks: Democratic Authorship as Political Autonomy": ["Public Reason Political Philosophy Podcast Symposium"]
            }
        },
        "Campus Talks": {
            "2015": {
                "General Will, Causality, Equality": ["Institute for Advanced Study, School of Social Science"],
                "The Logic of Coordination/The Logic of Commitment (book MS chapters)": ["Institute for Advanced Study, School of Social Science---Egalitarianism Workshop"],
                "Corruption and the Transnational Litigation Prisoner's Dilemma (co-author with Maya Steinitz)": ["Iowa Legal Studies Workshop"]
            },
            "2014": {
                "Racial Classification and Ascriptive Injury": ["Iowa Legal Studies Workshop"]
            },
            "2012": {
                "Equal Law in an Unequal World": ["Iowa Legal Studies Workshop"],
                "The Countermajoritarian Complaint": ["University of Iowa Food for Thought Speaker Series", "Annual Meeting of the American Society for Comparative Law (hosted at Iowa)"]
            },
            "2010": {
                "The Oligarch, the Miser, and the Capitalist: Plato, Kant, and Marx on the Psychology and Politics of the Money-Hungry": ["Stanford Ethics and Politics, Ancient and Modern Workshop"]
            }}}}